---
kind: property
id: P:Autodesk.Revit.DB.HermiteSpline.Parameters
source: html/bcc4791d-e851-a3ca-8027-5882dd71e777.htm
---
# Autodesk.Revit.DB.HermiteSpline.Parameters Property

Returns the params of the Hermite spline.

## Syntax (C#)
```csharp
public DoubleArray Parameters { get; }
```